[
  {
    "id": "1",
    "title": "Baked Ziti with Sausage and Bechamel | Pantry Staples | Everyday Food with Sarah Carey\n",
    "description": "There's a reason baked ziti is such a standby family dinner. It's comforting, filling, and all-round delicious. Here's an easy way to make the quintessential version of it with a rich, creamy bechamel and sausage.",
    "youtubeId": "KRhS1Leu4QY"
  },
  {
    "id": "2",
    "title": "How to Make Sourdough Croissants at Home | Homeschool | Everyday Food\n",
    "description": "Here’s a unique spin on making croissants. Sophie shares her tried and true method that combines a sourdough starter with the beloved French pastry. Whether you’re a novice or seasoned baker, this easy-to-follow tutorial will ensure buttery, puffy goodness at your next brunch.  ",
    "youtubeId": "htUKUzgF8zs"
  },
  {
    "id": "3",
    "title": "Martha Makes Delicious Dried Currant Bread Pudding | Homeschool with Martha | Everyday Food",
    "description": "Cozy up to this simple, comforting recipe for bread pudding. Martha layers pillow-y slices of brioche into a deep-dish casserole, and tops them with a custard made from a base of eggs, sugar, and cream. To add that little something special to the classic dish, she stirs in two kinds of citrus zests, brandy, and dried currants—making every bite extra delicious. ",
    "youtubeId": "G7dyJUSsbI8"
  },
  {
    "id": "4",
    "title": "REFRESHING Lillet Rose Summer Cocktail Recipe with Victoria Spencer | Homeschool | Everyday Food",
    "description": "illet Rose, a fortified-wine blend of Sauvignon Blanc and Muscatel, has the aroma of flowers and ripe berries -- perfect for a summer aperitif. Garnishing the drinks with edible flowers is a lovely touch. ",
    "youtubeId": "E9H5X7eZzNg"
  },
  {
    "id": "5",
    "title": "Martha Stewart Makes Pierogi From Big Martha’s Recipe | Homeschool with Martha | Everyday Food",
    "description": " Martha Stewart shares her family's pierogi recipe! Tune in for this episode of Homeschool, featuring Big Martha's Potato Pierogi and Cabbage Pierogi dishes. Martha is making her mom's classic potato filling, flavorful cabbage filling, and a delicious dough made from scratch! You won't want to miss this mouthwatering Polish recipe.  ",
    "youtubeId": "HELEcmHyzG8"
  },
  {
    "id": "6",
    "title": "Easy Chocolate Sheet Cake with Vanilla Buttercream Frosting 🍫 🍰 | Homeschool | Everyday Food\n",
    "description": " Cocoa powder and melted chocolate give this classic Chocolate Sheet Cake with Vanilla Buttercream deep, well-rounded flavor. Inspired by devil’s food cake, it's a party-perfect dessert that's rich but not overly sweet.",
    "youtubeId": "AJ6kQPH5p78"
  },
  {
    "id": "7",
    "title": "Decadent Chocolate Zucchini Cupcakes are a Chocolate Lover's Dream | Homeschool | Everyday Food",
    "description": "Are you in the mood for a decadent sweet treat? Look no further than these Chocolate Zucchini Cupcakes! This quick and easy recipe creates a chocolaty batch of baked goods that are super moist, thanks to the clever zucchini addition. Plus, they're topped with walnuts for an extra crunch! If you’re a chocolate lover, don't miss out on these sweet Chocolate Zucchini Cupcakes as the ultimate dessert! ",
    "youtubeId": "Shj2B7DhdIE"
  },
  {
    "id": "8",
    "title": "Easy Recipe for SAVORY Grilled Herbed Shrimp | Kitchen Conundrums | Everyday Food\n",
    "description": "Craving savory shrimp? Try this easy grilled herbed shrimp recipe! Simply marinate shrimp with fresh herbs such as cilantro and parsley, garlic, lemon, and jalapeño peppers. Then, grill until charred and perfectly pink. This seafood dish is a great appetizer for any warm weather occasion.",
    "youtubeId": "H-4RCqhHtlg"
  },
  {
    "id": "9",
    "title": "The BEST Crispy Chicken Parmesan | Kitchen Conundrums | Everyday Food\n",
    "description": "Chicken Parmesan is an easy and flavorful dish for any time of year, but getting that crispy chicken crust can be difficult without knowing the right way to do it. Thomas Joseph gives you all the tips and tricks and shows you how to make a crispy chicken parmesan full of flavor. ",
    "youtubeId": "OeeZtxePUdc"
  },
  {
    "id": "10",
    "title": "Homemade Delicious Double Coconut Cream Pie | The Slice | Everyday Food\n",
    "description": " Sweet chewy coconut, creamy custard, flaky buttery crust, and homemade whipped cream come together to create a taste of paradise in a slice. Greg Lofts shows you how to make this homemade delicious double coconut cream pie. ",
    "youtubeId": "41pAbEPcMCY"
  },
  {
    "id": "11",
    "title": "How to Make Leek and Goat Cheese Tart | THE SLICE | Everyday Food\n",
    "description": " Level up your brunch game with this easy and delicious tart recipe. Greg Lofts creates a Leek and Goat Cheese Tart - a twist on a quiche - which combines savory flavor and creamy texture for an irresistibly mouthwatering dish. ",
    "youtubeId": "4WJZAtIfs7E"
  }
]
